# Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за
# проезд и получали билет с номером. Счастливым билетом называют такой билет
# с шестизначным номером, где сумма первых трех цифр равна сумме последних
# трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам
# требуется написать программу, которая проверяет счастливость билета.
# *Пример:*
# 385916 -> yes
# 123456 -> no

# num = int(input('Введите 6-ти значный номер билета '))
# n1 = num // 100000
# n2 = num // 10000 - n1 * 10  # n2 = n // 10000 % 10
# n3 = num // 1000 - n1 * 100 - n2 * 10  # n3 = n // 1000 % 10
# n6 = num % 10
# n5 = int((num % 100 - n6) / 10)
# n4 = int((num % 1000 - (num % 100 - n6) - num % 10) / 100)  # n4 = n // 100 % 10
# print(n1, n2, n3, n4, n5, n6)
#
# flag = "No"
# if n1 + n2 + n3 == n4 + n5 + n6:
#     flag = 'Yes'
# print(flag)

# # 2
# n = input('Введите 6-ти значный номер билета ')
# fl = False
# if int(n[0]) + int(n[1]) + int(n[2]) == int(n[3]) + int(n[4]) + int(n[5]):
#     fl = True
# print(fl)

#3
numb = int(input('Введите 6-ти значный номер билета '))
res1 = numb // 1000
res2 = numb % 1000

sum1 = sum2 = 0

while res1 > 0:
    sum1 += res1 % 10
    res1 = res1 // 10

while res2 > 0:
    sum2 += res2 % 10
    res2 //= 10

if sum1 == sum2:
    print('Yes')
else:
    print('No')
