# Задание №1
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a = 3
b = 3.2
c = 'Three'
d = [1, 2, 3, 4]
e = a / a

print(type(a), type(b), type(c), type(d), type(e), sep='\n')


